---
kind: other
id: Methods.T:Autodesk.Revit.DB.ExternalService.IMultiServerService
source: html/20b5dc4c-ac02-3f55-1c18-9f612d1756d2.htm
---
# IMultiServerService Methods

Implement this to test whether a particular server should be executed.